[
	"لم يكن بالامكان أفضل مما كان.",
	"لو كان سهلا لفعله الجميع.",
	"ذهبت إلى السوق لأشتري ثيابا جديدة.",
	"المسلم من سلم المسلمون من لسانه ويده.",
	"ذو العقل يشقى في النعيم بعقله، وأخو الجهالة في الشقاوة ينعم.",
	"الناجح جزء من الحل، أما الفاشل فهو جزء من المشكلة.",
	"إذا ركلك أحد من خلفك، فاعلم أنك في المقدمة.",
	"يقول الناجح: يبدو الأمر صعبا ولكنه ممكن، أما الفاشل فيقول: الأمر ممكن ولكنه يبدو صعبا.",
	"العلم شيء رائع إذا لم تكن تعتاش منه.",
	"الأمهات هن فقط القادرات على التفكير في المستقبل لأنهن ينجبنه من خلال أطفالهن.",
	"كن قويا بما يكفي لمواجهة العالم كل يوم.",
	"ترويض الرغبات هو ما يصنع الشخصية.",
	"القراءة تمد العقل فقط بلوازم المعرفة، أما التفكير فيجعلنا نملك ما نقرأ.",
	"شعرت بالارتياح لأني قادر على الإجابة بسرعة، أقول لا أعرف.",
	"كلما ذاق المرء المزيد من المرارة زاد جوعه لمباهج الحياة.",
	"الطعام لذيذ جدا.",
	"قافلة الماضي لن تصل بك إلى أي مكان.",
	"الفلسفة ضرورية لأن كل شيء له معان مخفية يجب علينا معرفتها.",
	"الفشل هو الفرصة التي تتيح لك البدء من جديد بذكاء أكبر.",
	"لا يوجد شيء صعب عمليا إذا قمت بتقسيمه إلى أعمال صغيرة.",
	"ليس صاحب العمل هو من يدفع الأجور، ولكن المنتج هو من يدفع الأجر.",
	"أي شخص يتوقف عن التعلم هو عجوز، سواء كان في العشرين أو الثمانين.",
	"حرية الرأي تفترض أن لديك رأيا.",
	"لن أقول أن النساء ليس لديهن شخصية، بل لديهن كل يوم شخصية جديدة.",
	"النوم جيد، والموت أفضل منه، لكن بالطبع أفضل شيء ألا تكون قد ولدت من الأساس.",
	"إن الأمة التي يعرف رجالها كيف يموتون هي الأمة الجديرة بالحياة.",
	"ستتعلم الكثير من دروس الحياة، إذا لاحظت أن رجال الإطفاء لا يكافحون النار بالنار.",
	"إذا أردت أن تصمد للحياة فلا تأخذها على أنها مأساة.",
	"الحياة قصيرة، لكن المصائب تجعلها طويلة.",
	"الحياة حلم يوقظنا منه الموت.",
	"إننا لا نستحم في مياه النهر مرتين.",
	"بورك من ملأ حياته بعمل الخير لأنه أدرك أنها أقصر من أن يضيعها بعمل الشر.",
	"ليس للحياة قيمة إلا إذا وجدنا فيها شيئا نناضل من أجله.",
	"الحياة شعلة إما أن نحترق بنارها أو نطفئها ونعيش في ظلام.",
	"الحياة بلا فائدة موت مسبق.",
	"وللموت خير للفتى من حياته، إذا لم يثب للأمر ألا بقائد.",
	"تعست، هذه الحياة فما يسعد فيها إلا الجهول ويرتع، هي الدنيا في كل يوم ترينا، من جديد الآلام ما هو أوجع.",
	"الله عليك يا فخر العرب.",
	"الحياة رواية جميلة عليك قراءتها حتى النهاية، لا تتوقف أبدا عند سطر حزين قد تكون النهاية جميلة.",
	"ثم إن الحب قدر وقدر وقدرة وقرة ووقار ومستقر وقرار.",
	"اليوم العالمي للغة.",
	"إذا رأيت أنياب الليث بارزة، فلا تظن أن الليث يبتسم.",
	"يا أعدل الناس إلا في معاملتي، فيك الخصام و أنت الخصم والحكم.",
	"ما في المقام لذي عقل وذي أدب من راحة فدع الأوطان واغترب.",
	"تعصي الإله وأنت تظهر حبه هذا محال في القياس بديع.",
	"ارحل بنفسك من أرض تضام بها ولا تكن من فراق الأهل في حرق.",
	"ففي الناس أبدال وفي الترك راحة وفي القلب صبر للحبيب ولو جفا.",
	"توكلت في رزقي على الله خالقي وأيقنت أن الله لا شك رازقي.",
	"ولا تعطين الرأي من لا يريده فلا أنت محمود ولا الرأي نافعه.",
	"ما حك جلدك مثل ظفرك فتول أنت جميع أمرك، وإذا قصدت لحاجة فاقصد لمعترف بفضلك."
]